app/views/chart/feed.html.erb

SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (date::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_date_timestamptz_interval_0_second_at_time_zone_ FROM "tornados" WHERE "tornados"."st" IS NULL AND (date IS NOT NULL) GROUP BY (DATE_TRUNC('day', (date::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
        <p><b>USA tornadoes 2016</b></p>
        <%= bar_chart Tornado.group(:st).count, id: "users-chart", width: "1020px", height: "700px", xtitle: "Total number of tornadoes", ytitle: "State" %>