app/views/chart/time.html.erb

SELECT "earthquakes".* FROM "earthquakes" ORDER BY time ASC
---
<!--    <div id="container" style="min-width: 310px; height: 400px; margin: 0 auto"></div>-->
<!--    <%= content_tag "div", id: "items", data: {url: Earthquake.order('time ASC') } do %>-->

SELECT "tornados".* FROM "tornados" ORDER BY date ASC
---
        <!--<div id="container2" style="min-width: 310px; height: 400px; margin: 0 auto"></div>-->
        <%= content_tag "div", id: "items", data: {url: Tornado.order('date ASC') } do %>

SELECT COUNT(*) AS count_all, (DATE_TRUNC('month', (date::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_month_date_timestamptz_interval_0_second_at_time_zon FROM "tornados" WHERE (date IS NOT NULL) GROUP BY (DATE_TRUNC('month', (date::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'
---
      <div class="jumbotron myBackground4">
      <%= line_chart Tornado.group_by_day(:date).count %>