app/controllers/chart_controller.rb

  def feed
     @state = params[:state]
     if @state != nil
      @text = "Total number of tornadoes in #{@state} in 2016 is:#{Tornado.where(:st => @state).count}"
---
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (date::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_date_timestamptz_interval_0_second_at_time_zone_ FROM "tornados" WHERE "tornados"."st" IS NULL AND (date IS NOT NULL) GROUP BY (DATE_TRUNC('day', (date::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'